WRONG_REQUEST = (
    '❗️ Некорректный запрос. '
    'Отправьте просто число, сколько денег было потрачено, '
    'значение должно быть больше нуля.'
)

UPDATE_MESSAGE = (
    '✅ Зачислено <b>{}</b> рублей в категорию <b>{}</b>. '
    'Всего осталось до конца месяца: <b>{}</b>'
)

CHOOSE_CATEGORY = '⬇️ Выбери категорию для траты {} денег'

NO_CATEGORIES = (
    '❗️ Сначала создайте хотя бы одну категорию, '
    'чтобы добавлять траты: /add_category'
)

DELETE_MESSAGE = (
    '❌ Трата на сумму <b>{}</b> рублей в категории {} была <b>удалена</b>. '
    'Остаток средств до конца месяца: <b>{}</b>'
)

MONEY_LEFT_MESSAGE = '📝 Осталось денег до конца месяца: {}'

START_MESSAGE = (
    '📝 Теперь ты можешь вести бюджет. Просто пиши мне цифру денег, '
    'которую ты потратил и выбери нужную категорию.'
)

ACTION_CANCELED = '❌ Действие отменено.'

ENTER_CATEGORY_NAME = (
    'Введите название категории трат, '
    'которую хотите создать, для отмены /cancel'
)

CATEGORY_ADD_SUCCESS = '✅ Категория с названием "{}" была успешно добавлена!'

CATEGORY_ALREADY_EXISTS = (
    '❗️ Категория с названием "{}" уже существует. '
    'Добавьте категорию с уникальным названием или /cancel'
)
