WRONG_REQUEST = (
    'Некорректный запрос. '
    'Отправьте просто число, сколько денег было потрачено, '
    'значение должно быть больше нуля.'
)

UPDATE_MESSAGE = (
    'Зачислено <b>{}</b> рублей в категорию <b>{}</b>. '
    'Всего осталось до конца месяца: <b>{}</b>'
)

CHOOSE_CATEGORY = 'Выбери категорию для траты {} денег'

DELETE_MESSAGE = (
    'Трата на сумму <b>{}</b> рублей в категории {} была <b>удалена</b>. '
    'Остаток средств до конца месяца: <b>{}</b>'
)

MONEY_LEFT_MESSAGE = 'Осталось денег до конца месяца: {}'

START_MESSAGE = (
    'Теперь ты можешь вести бюджет. Просто пиши мне цифру денег, '
    'которую ты потратил и выбери нужную категорию.'
)
